/* BLOCK_HEADER_BEGIN =======================================================================
파일명 : ITableValue.cs
수정일 : 2026-05-01

# 설명
테이블에 저장될 수 있는 데이터를 위한 인터페이스.
========================================================================= BLOCK_HEADER_END */

namespace inonego.Xeri
{
    // ============================================================
    /// <summary>
    /// 테이블에 저장될 수 있는 데이터를 위한 인터페이스.
    /// </summary>
    // ============================================================
    public interface ITableValue : IKeyable<string> {}
}
