/* BLOCK_HEADER_BEGIN =======================================================================
파일명 : DropEventArgs.cs
수정일 : 2026-05-22

# 설명
UI 시스템에 독립적인 드롭 이벤트 인자.
========================================================================= BLOCK_HEADER_END */

using System;

namespace inonego.Xeri.UI.DragDrop
{
    // ============================================================
    /// <summary>
    /// 드롭 이벤트 핸들러.
    /// </summary>
    // ============================================================
    public delegate void DropEventHandler(DropZone sender, DropEventArgs e);

    // ============================================================
    /// <summary>
    /// 드롭 이벤트 인자.
    /// </summary>
    // ============================================================
    [Serializable]
    public struct DropEventArgs
    {
        // ------------------------------------------------------------
        /// <summary>
        /// 드롭 대상에 들어온 드래그 대상.
        /// </summary>
        // ------------------------------------------------------------
        public Draggable Draggable;

        // ------------------------------------------------------------
        /// <summary>
        /// 드롭 이벤트가 발생한 드롭 영역.
        /// </summary>
        // ------------------------------------------------------------
        public DropZone DropZone;
    }
}
