/* BLOCK_HEADER_BEGIN =======================================================================
파일명 : IDropResolver.cs
수정일 : 2026-05-22

# 설명
입력 위치와 드래그 대상을 기준으로 최종 드롭존을 결정하는 인터페이스.
========================================================================= BLOCK_HEADER_END */

namespace inonego.Xeri.UI.DragDrop
{
    // ============================================================
    /// <summary>
    /// 드롭 대상 결정자.
    /// </summary>
    // ============================================================
    public interface IDropResolver
    {
        // ------------------------------------------------------------
        /// <summary>
        /// 입력 지점과 드래그 대상을 기준으로 드롭 영역을 찾는다.
        /// </summary>
        // ------------------------------------------------------------
        DropZone Resolve(InputPoint input, Draggable draggable);
    }
}
