/* BLOCK_HEADER_BEGIN =======================================================================
파일명 : IDropRule.cs
수정일 : 2026-05-22

# 설명
드롭 가능 여부를 판단하는 규칙 인터페이스.
========================================================================= BLOCK_HEADER_END */

namespace inonego.Xeri.UI.DragDrop
{
    // ============================================================
    /// <summary>
    /// 드롭 가능 여부 판단 규칙.
    /// </summary>
    // ============================================================
    public interface IDropRule
    {
        // ------------------------------------------------------------
        /// <summary>
        /// 드래그 대상이 드롭 영역에 드롭될 수 있는지 확인한다.
        /// </summary>
        // ------------------------------------------------------------
        bool CanDrop(Draggable draggable, DropZone dropZone);
    }
}
