/* BLOCK_HEADER_BEGIN =======================================================================
파일명 : IBoardSpace.cs
수정일 : 2026-05-01

# 설명
보드의 공간(특정 위치에 놓인 객체들의 컨테이너)을 나타내는 인터페이스.
========================================================================= BLOCK_HEADER_END */

using System;

namespace inonego.Xeri.Game
{
    // ============================================================
    /// <summary>
    /// 보드의 공간을 나타낸 인터페이스입니다.
    /// </summary>
    // ============================================================
    public interface IBoardSpace<TIndex, TPlaceable>
    where TIndex : struct
    where TPlaceable : class
    {
        //------------------------------------------------------------
        /// <summary>
        /// 지정된 인덱스에 있는 객체를 반환합니다.
        /// </summary>
        //------------------------------------------------------------
        public TPlaceable this[TIndex index] { get; }
    }
}
