/* BLOCK_HEADER_BEGIN =======================================================================
파일명 : IBoardPoint.cs
수정일 : 2026-05-01

# 설명
보드의 특정 위치(벡터 + 인덱스)를 나타내는 인터페이스.
========================================================================= BLOCK_HEADER_END */

using System;

namespace inonego.Xeri.Game
{
    // ============================================================
    /// <summary>
    /// 보드의 포인트를 나타내는 인터페이스입니다.
    /// </summary>
    // ============================================================
    public interface IBoardPoint<TVector, TIndex>
    where TVector : struct where TIndex : struct
    {
        //------------------------------------------------------------
        /// <summary>
        /// 벡터를 반환합니다.
        /// </summary>
        //------------------------------------------------------------
        public TVector Vector { get; }

        //------------------------------------------------------------
        /// <summary>
        /// 인덱스를 반환합니다.
        /// </summary>
        //------------------------------------------------------------
        public TIndex Index { get; }
    }
}
