/* BLOCK_HEADER_BEGIN =======================================================================
파일명 : IKeyable.cs
수정일 : 2026-05-01

# 설명
키를 가질 수 있는 객체를 위한 인터페이스.
========================================================================= BLOCK_HEADER_END */

using System;

namespace inonego.Xeri
{
    // ============================================================
    /// <summary>
    /// 키를 가질 수 있는 객체를 위한 인터페이스.
    /// </summary>
    // ============================================================
    public interface IKeyable<TKey>
    where TKey : IEquatable<TKey>
    {
        // ------------------------------------------------------------
        /// <summary>
        /// 서로 다른 객체끼리 구분하기 위한 키.
        /// </summary>
        // ------------------------------------------------------------
        public TKey Key { get; }

        // ------------------------------------------------------------
        /// <summary>
        /// 키가 설정되어 있는지 여부.
        /// </summary>
        // ------------------------------------------------------------
        public bool HasKey { get; }
    }
}
