/* BLOCK_HEADER_BEGIN =======================================================================
파일명 : IXeriWindowDriver.cs
수정일 : 2026-05-23

# 설명
Xeri 커스텀 윈도우 controller가 실제 표시 계층에 상태를 반영하기 위한 driver 계약.
========================================================================= BLOCK_HEADER_END */

using UnityEngine;

namespace inonego.Xeri.UI.Window
{
    // ============================================================
    /// <summary>
    /// Xeri 커스텀 윈도우 표시 driver 계약.
    /// </summary>
    // ============================================================
    public interface IXeriWindowDriver
    {

    #region 프로퍼티

        // ------------------------------------------------------------
        /// <summary>
        /// 윈도우 위치.
        /// </summary>
        // ------------------------------------------------------------
        Vector2 Pos { get; set; }

        // ------------------------------------------------------------
        /// <summary>
        /// 윈도우 크기.
        /// </summary>
        // ------------------------------------------------------------
        Vector2 Size { get; set; }

        // ------------------------------------------------------------
        /// <summary>
        /// 윈도우 표시 상태.
        /// </summary>
        // ------------------------------------------------------------
        XeriWindowState State { get; set; }

    #endregion

    }
}
