/* BLOCK_HEADER_BEGIN =======================================================================
파일명 : IBindable.cs
수정일 : 2026-06-17

# 설명
외부 대상과 바인딩/해제가 필요한 객체를 위한 인터페이스.
파라미터 없는 버전과 추가 파라미터를 받는 버전 두 가지를 제공한다.
========================================================================= BLOCK_HEADER_END */

namespace inonego.Xeri
{
    // ============================================================
    /// <summary>
    /// 외부 대상에 바인딩될 수 있는 객체를 위한 인터페이스입니다.
    /// </summary>
    // ============================================================
    public interface IBindable<T>
    {
        // ------------------------------------------------------------
        /// <summary>
        /// 외부 대상에 바인딩합니다.
        /// </summary>
        // ------------------------------------------------------------
        public void Bind(T target);

        // ------------------------------------------------------------
        /// <summary>
        /// 외부 대상과의 바인딩을 해제합니다.
        /// </summary>
        // ------------------------------------------------------------
        public void Unbind();
    }

    // ============================================================
    /// <summary>
    /// 추가 파라미터와 함께 외부 대상에 바인딩될 수 있는 객체를 위한 인터페이스입니다.
    /// </summary>
    // ============================================================
    public interface IBindable<T, TParam>
    {
        // ------------------------------------------------------------
        /// <summary>
        /// 추가 파라미터와 함께 외부 대상에 바인딩합니다.
        /// </summary>
        // ------------------------------------------------------------
        public void Bind(T target, TParam param);

        // ------------------------------------------------------------
        /// <summary>
        /// 외부 대상과의 바인딩을 해제합니다.
        /// </summary>
        // ------------------------------------------------------------
        public void Unbind();
    }
}
