/* BLOCK_HEADER_BEGIN =======================================================================
파일명 : IRangeValue.cs
수정일 : 2026-05-07

# 설명
RangeValue 인터페이스 모음.

- IReadOnlyRangeValue<T> : 외부 노출용. Range·Min·Max 를 읽기 전용으로 노출.
- IRangeValue<T>        : 시스템 내부용. Range 를 mutable 로 노출.
========================================================================= BLOCK_HEADER_END */

using System;

namespace inonego.Xeri.Serializable
{
    using Primitive; // inonego.Xeri.Primitive

    // ===================================================================
    /// <summary>
    /// 범위 제한 Value 읽기 전용 뷰 인터페이스.
    /// </summary>
    // ===================================================================
    public interface IReadOnlyRangeValue<T> : IReadOnlyValue<T>, IComparable<T>
    where T : struct, IComparable<T>
    {
        // ------------------------------------------------------------
        /// <summary>
        /// 값을 제한하는 범위(읽기 전용).
        /// </summary>
        // ------------------------------------------------------------
        IReadOnlyValue<Range<T>> Range { get; }

        // ------------------------------------------------------------
        /// <summary>
        /// 최솟값.
        /// </summary>
        // ------------------------------------------------------------
        T Min { get; }

        // ------------------------------------------------------------
        /// <summary>
        /// 최댓값.
        /// </summary>
        // ------------------------------------------------------------
        T Max { get; }
    }

    // ===================================================================
    /// <summary>
    /// 범위 제한 Value 변경 가능 인터페이스.
    /// </summary>
    // ===================================================================
    public interface IRangeValue<T> : IReadOnlyRangeValue<T>, IValue<T>
    where T : struct, IComparable<T>
    {
        // ------------------------------------------------------------
        /// <summary>
        /// 값을 제한하는 범위.
        /// </summary>
        // ------------------------------------------------------------
        new IValue<Range<T>> Range { get; }
    }
}
