/* BLOCK_HEADER_BEGIN =======================================================================
파일명 : IReadOnlyRangeValue.cs
수정일 : 2026-04-29

# 설명
범위 제한이 있는 값의 읽기 전용 뷰 인터페이스.
IReadOnlyValue<T>와 IComparable<T>를 함께 상속한다.
========================================================================= BLOCK_HEADER_END */

using System;

namespace inonego.Xeri.Serializable
{
    using Primitive; // inonego.Xeri.Primitive

    // ===================================================================
    /// <summary>
    /// 범위 제한 Value 읽기 전용 뷰 인터페이스.
    /// </summary>
    // ===================================================================
    public interface IReadOnlyRangeValue<T> : IReadOnlyValue<T>, IComparable<T>
    where T : struct, IComparable<T>
    {
        // ------------------------------------------------------------
        /// <summary>
        /// 값을 제한하는 범위.
        /// </summary>
        // ------------------------------------------------------------
        IReadOnlyValue<MinMax<T>> Range { get; }

        // ------------------------------------------------------------
        /// <summary>
        /// 최솟값.
        /// </summary>
        // ------------------------------------------------------------
        T Min { get; }

        // ------------------------------------------------------------
        /// <summary>
        /// 최댓값.
        /// </summary>
        // ------------------------------------------------------------
        T Max { get; }
    }
}
