/* BLOCK_HEADER_BEGIN =======================================================================
파일명 : DragEventArgs.cs
수정일 : 2026-05-22

# 설명
UI 시스템에 독립적인 드래그 이벤트 인자.
========================================================================= BLOCK_HEADER_END */

using System;

using UnityEngine;

namespace inonego.Xeri.UI.DragDrop
{
    // ============================================================
    /// <summary>
    /// 드래그 이벤트 핸들러.
    /// </summary>
    // ============================================================
    public delegate void DragEventHandler(Draggable sender, DragEventArgs e);

    // ============================================================
    /// <summary>
    /// 드래그 이벤트 인자.
    /// </summary>
    // ============================================================
    [Serializable]
    public struct DragEventArgs
    {
        // ------------------------------------------------------------
        /// <summary>
        /// 현재 드래그 대상 위치.
        /// </summary>
        // ------------------------------------------------------------
        public Vector2 Pos;

        // ------------------------------------------------------------
        /// <summary>
        /// 입력과 오프셋으로 계산된 목표 위치.
        /// </summary>
        // ------------------------------------------------------------
        public Vector2 GoalPos;

        // ------------------------------------------------------------
        /// <summary>
        /// 드래그 시작 기준 위치.
        /// </summary>
        // ------------------------------------------------------------
        public Vector2 OriginPos;

        // ------------------------------------------------------------
        /// <summary>
        /// 입력 좌표와 드래그 대상 위치 간의 오프셋.
        /// </summary>
        // ------------------------------------------------------------
        public Vector2 Offset;
    }
}
