/* BLOCK_HEADER_BEGIN =======================================================================
파일명 : IDragCoordinateProvider.cs
수정일 : 2026-05-22

# 설명
드래그 대상의 위치와 입력 좌표 변환을 제공한다.
========================================================================= BLOCK_HEADER_END */

using UnityEngine;

namespace inonego.Xeri.UI.DragDrop
{
    // ============================================================
    /// <summary>
    /// 드래그 좌표 Provider.
    /// </summary>
    // ============================================================
    public interface IDragCoordinateProvider
    {
        // ------------------------------------------------------------
        /// <summary>
        /// 드래그 대상의 기준 위치.
        /// </summary>
        // ------------------------------------------------------------
        Vector2 Pos { get; set; }

        // ------------------------------------------------------------
        /// <summary>
        /// 입력 좌표를 드래그 대상 기준 좌표로 변환한다.
        /// </summary>
        // ------------------------------------------------------------
        Vector2 ToLocalPos(Vector2 inputPos);
    }
}
