/* BLOCK_HEADER_BEGIN =======================================================================
파일명 : IDocumentModel.cs
수정일 : 2026-06-19

# 설명
Workspace에서 편집할 문서의 실제 데이터 모델을 정의한다.
비제네릭 인터페이스는 공통 문서 관리에, 제네릭 인터페이스는 강타입 편집기에 사용한다.
========================================================================= BLOCK_HEADER_END */

namespace inonego.Xeri.Workspace.Document
{
   // ============================================================
   /// <summary>
   /// Workspace에서 관리되는 문서 모델의 공통 인터페이스.
   /// </summary>
   // ============================================================
   public interface IDocumentModel
   {
      // ------------------------------------------------------------
      /// <summary>
      /// 실제 편집 대상 값.
      /// </summary>
      // ------------------------------------------------------------
      object Value { get; }
   }

   // ============================================================
   /// <summary>
   /// 강타입 편집 대상 값을 제공하는 문서 모델 인터페이스.
   /// </summary>
   // ============================================================
   public interface IDocumentModel<T> : IDocumentModel
   {
      // ------------------------------------------------------------
      /// <summary>
      /// 실제 편집 대상 값.
      /// </summary>
      // ------------------------------------------------------------
      new T Value { get; }
   }
}
