/* BLOCK_HEADER_BEGIN =======================================================================
파일명 : IGameObjectProvider.cs
수정일 : 2026-05-01

# 설명
게임 오브젝트를 생성하여 가져오거나 반환하도록 도와주는 인터페이스.
동기(Acquire) 및 비동기(AcquireAsync) 획득을 모두 지원한다.
========================================================================= BLOCK_HEADER_END */

using UnityEngine;

namespace inonego.Xeri
{
    // ============================================================
    /// <summary>
    /// 게임 오브젝트를 생성하여 가져오거나 반환하도록 도와주는 인터페이스입니다.
    /// </summary>
    // ============================================================
    public interface IGameObjectProvider
    {

    #region 필드

        // ------------------------------------------------------------
        /// <summary>
        /// <br/>게임 오브젝트를 생성할 위치입니다.
        /// <br/>null인 경우, 루트에 생성됩니다.
        /// </summary>
        // ------------------------------------------------------------
        public Transform Parent { get; set; }

    #endregion

    #region 메서드

        // ------------------------------------------------------------
        /// <summary>
        /// 게임 오브젝트를 가져옵니다.
        /// </summary>
        // ------------------------------------------------------------
        public GameObject Acquire(bool worldPositionStays = true);

        // ------------------------------------------------------------
        /// <summary>
        /// 게임 오브젝트를 비동기로 가져옵니다.
        /// </summary>
        // ------------------------------------------------------------
        public Awaitable<GameObject> AcquireAsync(bool worldPositionStays = true);

        // ------------------------------------------------------------
        /// <summary>
        /// 게임 오브젝트를 반환합니다.
        /// </summary>
        // ------------------------------------------------------------
        public void Release(GameObject go, bool worldPositionStays = true);

    #endregion

    }
}
