/* BLOCK_HEADER_BEGIN =======================================================================
파일명 : IEntityView.cs
수정일 : 2026-07-28

# 설명
Entity 모델을 Unity View로 표현하기 위한 인터페이스 모음.

- IReadOnlyEntityView : 외부 노출용. Entity·Key를 읽기 전용으로 노출한다.
- IEntityView         : 시스템 내부용. 변경 가능한 Entity 노출을 제공한다.
========================================================================= BLOCK_HEADER_END */

namespace inonego.Xeri.Game
{
    // ============================================================
    /// <summary>
    /// Entity View 읽기 전용 인터페이스.
    /// </summary>
    // ============================================================
    public interface IReadOnlyEntityView : IKeyable<ulong>
    {
        // ------------------------------------------------------------
        /// <summary>
        /// 대응되는 논리 엔티티.
        /// </summary>
        // ------------------------------------------------------------
        IReadOnlyEntity Entity { get; }
    }

    // ============================================================
    /// <summary>
    /// Entity View 시스템 내부 인터페이스.
    /// </summary>
    // ============================================================
    public interface IEntityView : IReadOnlyEntityView
    {
        // ------------------------------------------------------------
        /// <summary>
        /// 대응되는 논리 엔티티.
        /// </summary>
        // ------------------------------------------------------------
        new IEntity Entity { get; }
    }
}
