/* BLOCK_HEADER_BEGIN =======================================================================
파일명 : IKeyGenerator.cs
수정일 : 2026-05-01

# 설명
키 생성기 인터페이스.
========================================================================= BLOCK_HEADER_END */

using System;

namespace inonego.Xeri
{
    // ============================================================
    /// <summary>
    /// 키 생성기 인터페이스.
    /// </summary>
    // ============================================================
    public interface IKeyGenerator<TKey>
    where TKey : IEquatable<TKey>
    {
        // ------------------------------------------------------------
        /// <summary>
        /// 새로운 키를 생성한다.
        /// </summary>
        // ------------------------------------------------------------
        public TKey Generate();
    }
}
