/* BLOCK_HEADER_BEGIN =======================================================================
파일명 : InputPoint.cs
수정일 : 2026-05-22

# 설명
UI 입력 한 지점을 표현하는 값 타입.
========================================================================= BLOCK_HEADER_END */

using System;

using UnityEngine;

namespace inonego.Xeri.UI.DragDrop
{
    // ============================================================
    /// <summary>
    /// UI 입력 지점.
    /// </summary>
    // ============================================================
    [Serializable]
    public readonly struct InputPoint
    {
        // ------------------------------------------------------------
        /// <summary>
        /// 입력 식별자.
        /// </summary>
        // ------------------------------------------------------------
        public readonly int ID;

        // ------------------------------------------------------------
        /// <summary>
        /// 입력 좌표.
        /// </summary>
        // ------------------------------------------------------------
        public readonly Vector2 Pos;

        // ------------------------------------------------------------
        /// <summary>
        /// 입력 지점 값을 생성한다.
        /// </summary>
        // ------------------------------------------------------------
        public InputPoint(int id, Vector2 pos)
        {
            ID  = id;
            Pos = pos;
        }
    }
}
