/* BLOCK_HEADER_BEGIN =======================================================================
파일명 : ILevel.cs
수정일 : 2026-05-01

# 설명
레벨을 읽고 쓸 수 있는 인터페이스.
========================================================================= BLOCK_HEADER_END */

using System;

namespace inonego.Xeri.Game
{
    // =======================================================================================
    /// <summary>
    /// 레벨 인터페이스입니다.
    /// </summary>
    // =======================================================================================
    public interface ILevel
    {

    #region 필드

        // ------------------------------------------------------------
        /// <summary>
        /// 현재 레벨입니다.
        /// </summary>
        // ------------------------------------------------------------
        public int Value { get; set; }

        // ------------------------------------------------------------
        /// <summary>
        /// 최소 레벨의 값입니다.
        /// </summary>
        // ------------------------------------------------------------
        public int Min { get; }

        // ------------------------------------------------------------
        /// <summary>
        /// <br/>현재 도달할 수 있는 최대 레벨의 값입니다.
        /// <br/>
        /// </summary>
        // ------------------------------------------------------------
        public int Max { get; }

        // ------------------------------------------------------------
        /// <summary>
        /// <br/>제한된 최대 레벨의 값입니다.
        /// <br/>변동되는 최대 레벨을 조절하기 위해 사용됩니다.
        /// <br/>이 값은 범위에 상관 없이 설정할 수 있지만,
        /// <br/>Max 값은 LimitMax, FullMax 값 중 작은 값으로 설정됩니다.
        /// </summary>
        // ------------------------------------------------------------
        public int LimitMax { get; set; }

        // ------------------------------------------------------------
        /// <summary>
        /// <br/>최대로 도달할 수 있는 레벨의 값입니다.
        /// <br/>이 값은 객체 생성 후 변경할 수 없습니다.
        /// </summary>
        // ------------------------------------------------------------
        public int FullMax { get; }

        // ------------------------------------------------------------
        /// <summary>
        /// 레벨 업을 제한할지를 결정합니다.
        /// </summary>
        // ------------------------------------------------------------
        public bool BlockLevelUp { get; set; }

        // ------------------------------------------------------------
        /// <summary>
        /// 현재 레벨에서 다음 레벨로 넘어갈 수 있는지를 반환합니다.
        /// </summary>
        // ------------------------------------------------------------
        public bool CanLevelUp { get; }

    #endregion

    #region 이벤트

        // ------------------------------------------------------------
        /// <summary>
        /// 레벨 업 이벤트입니다. 레벨이 1 오를때마다 호출됩니다.
        /// </summary>
        // ------------------------------------------------------------
        public event EventHandler<LevelUpEventArgs> OnLevelUp;

    #endregion

    #region 메서드

        // ------------------------------------------------------------
        /// <summary>
        /// 레벨 업 시킵니다.
        /// </summary>
        // ------------------------------------------------------------
        public void LevelUp(int amount = 1);

    #endregion

    }

}
