/* BLOCK_HEADER_BEGIN =======================================================================
파일명 : LoggerBase.cs
수정일 : 2026-05-07

# 설명
ILogger 구현을 위한 추상 기반 클래스. log 필드로 출력 여부를 인스펙터에서 제어한다.
========================================================================= BLOCK_HEADER_END */

using System;

using UnityEngine;

namespace inonego.Xeri.Utility
{
    // ============================================================
    /// <summary>
    /// ILogger 구현을 위한 추상 기반 클래스.
    /// </summary>
    // ============================================================
    [Serializable]
    public abstract class LoggerBase : ILogger
    {

    #region 필드

        // ------------------------------------------------------------
        /// <summary>
        /// 로그 출력 여부.
        /// </summary>
        // ------------------------------------------------------------
        [SerializeField]
        protected bool log = true;

    #endregion

    #region 메서드

        // ------------------------------------------------------------
        /// <summary>
        /// 일반 로그를 출력한다.
        /// </summary>
        // ------------------------------------------------------------
        public abstract void Log(string message);

        // ------------------------------------------------------------
        /// <summary>
        /// 경고 로그를 출력한다.
        /// </summary>
        // ------------------------------------------------------------
        public abstract void LogWarning(string message);

        // ------------------------------------------------------------
        /// <summary>
        /// 오류 로그를 출력한다.
        /// </summary>
        // ------------------------------------------------------------
        public abstract void LogError(string message);

    #endregion

    }
}
