/* BLOCK_HEADER_BEGIN =======================================================================
파일명 : IGroundChecker.cs
수정일 : 2026-05-01

# 설명
바닥 감지 기능을 정의하는 인터페이스.
OnLand/OnLeave 이벤트와 Check 메서드를 제공한다.
========================================================================= BLOCK_HEADER_END */

using UnityEngine;

using inonego.Xeri;

namespace inonego.Xeri.Game.Controller
{
    // ============================================================
    /// <summary>
    /// 바닥 감지 기능을 정의하는 인터페이스입니다.
    /// </summary>
    // ============================================================
    public interface IGroundChecker
    {

    #region 필드

        // ------------------------------------------------------------
        /// <summary>
        /// 현재 바닥에 있는지 여부를 가져옵니다.
        /// </summary>
        // ------------------------------------------------------------
        public bool IsOnGround { get; }

        // ------------------------------------------------------------
        /// <summary>
        /// 현재 속도를 가져옵니다.
        /// </summary>
        // ------------------------------------------------------------
        public Vector3 Velocity { get; }

        // ------------------------------------------------------------
        /// <summary>
        /// 바닥이 가지고 있는 속도를 가져옵니다.
        /// </summary>
        // ------------------------------------------------------------
        public Vector3 GroundVelocity { get; }

        // ------------------------------------------------------------
        /// <summary>
        /// 중력의 벡터 값을 가져옵니다.
        /// </summary>
        // ------------------------------------------------------------
        public Vector3 Gravity { get; }

        // ------------------------------------------------------------
        /// <summary>
        /// 작동을 위한 게임 오브젝트입니다.
        /// </summary>
        // ------------------------------------------------------------
        public GameObject GameObject { get; }

    #endregion

    #region 이벤트

        // ------------------------------------------------------------
        /// <summary>
        /// 바닥에 착지했을 때 이벤트를 발생시킵니다.
        /// </summary>
        // ------------------------------------------------------------
        public event ValueChangeEventHandler<GameObject> OnLand;

        // ------------------------------------------------------------
        /// <summary>
        /// 바닥을 벗어났을 때 이벤트를 발생시킵니다.
        /// </summary>
        // ------------------------------------------------------------
        public event ValueChangeEventHandler<GameObject> OnLeave;

    #endregion

    #region 메서드

        // ------------------------------------------------------------
        /// <summary>
        /// 바닥 체크를 위한 업데이트를 진행합니다.
        /// </summary>
        // ------------------------------------------------------------
        public void Check(float deltaTime);

    #endregion

    }
}
